{
  "ir_version": "0.1",
  "task_id": "task_pick_place_fixture_pocket_001",
  "created_by": "nl_parser",
  "created_at": "2026-03-19T09:42:00+09:00",
  "task_spec": {
    "goal": "pick_and_place",
    "command_text": "Pick the red block and place it into the fixture pocket.",
    "priority": "normal",
    "success_condition": [
      "object_at_destination:block_red:fixture_pocket",
      "no_collision",
      "release_completed"
    ],
    "assumptions": [
      "block_red_pose_known",
      "target_zone_pose_known",
      "gripper_attached",
      "block_red_top_surface_known",
      "fixture_pocket_known"
    ]
  },
  "robot_profile": {
    "robot_type": "generic_cobot",
    "arm_dof": 6,
    "has_gripper": true,
    "tool_frame": "gripper_tcp",
    "base_frame": "world",
    "motion_limits_profile": "default_cobot"
  },
  "world_binding": {
    "scene_id": "scene_pick_place_fixture_pocket_01",
    "objects": {
      "block_red": "obj_block_red_01",
      "target_zone": "obj_target_zone_01"
    },
    "frames": {
      "block_red_frame": "obj_block_red_01/frame",
      "target_zone_frame": "obj_target_zone_01/frame",
      "home_frame": "robot/home_pose"
    },
    "regions": {
      "safe_approach_zone": "region_safe_approach_01",
      "place_zone": "region_place_01"
    },
    "features": {
      "block_red_top_surface": {
        "parent_object": "block_red",
        "feature_type": "surface",
        "frame": "block_red_frame",
        "description": "Top graspable surface of the red block"
      },
      "target_surface": {
        "parent_object": "target_zone",
        "feature_type": "surface",
        "frame": "target_zone_frame",
        "description": "Surface feature declared for alternate variants"
      },
      "target_slot": {
        "parent_object": "target_zone",
        "feature_type": "slot",
        "frame": "target_zone_frame",
        "description": "Slot feature declared for alternate variants"
      },
      "fixture_pocket": {
        "parent_object": "target_zone",
        "feature_type": "pocket",
        "frame": "target_zone_frame",
        "description": "Pocket feature used as the placement target"
      }
    }
  },
  "action_plan": [
    {
      "step_id": "s1",
      "type": "find_object",
      "inputs": {
        "object": "block_red"
      },
      "constraints": {
        "must_exist": true
      },
      "expected_effects": [
        "object_pose_bound:block_red"
      ],
      "on_failure": {
        "policy": "abort"
      },
      "status": "planned"
    },
    {
      "step_id": "s2",
      "type": "approach",
      "inputs": {
        "target_object": "block_red",
        "approach_pose": {
          "ref": "block_red_frame",
          "offset": [
            0.0,
            0.0,
            0.08
          ],
          "orientation_policy": "align_with_object_top"
        },
        "target_feature": "block_red_top_surface"
      },
      "constraints": {
        "min_clearance": 0.02,
        "speed": 0.12
      },
      "expected_effects": [
        "tcp_at_pregrasp_pose:block_red_top_surface"
      ],
      "on_failure": {
        "policy": "retry_with_higher_clearance"
      },
      "status": "planned"
    },
    {
      "step_id": "s3",
      "type": "grasp",
      "inputs": {
        "target_object": "block_red",
        "grasp_mode": "parallel_top_grasp",
        "target_feature": "block_red_top_surface"
      },
      "constraints": {
        "grip_force": 18.0,
        "require_contact": true
      },
      "expected_effects": [
        "object_attached:block_red",
        "grasp_target_feature:block_red:block_red_top_surface"
      ],
      "on_failure": {
        "policy": "retry_with_alternative_grasp"
      },
      "status": "planned"
    },
    {
      "step_id": "s4",
      "type": "retreat",
      "inputs": {
        "direction": "tool_z_negative",
        "distance": 0.08
      },
      "constraints": {
        "speed": 0.12
      },
      "expected_effects": [
        "tcp_cleared_from_pick_zone"
      ],
      "on_failure": {
        "policy": "abort"
      },
      "status": "planned"
    },
    {
      "step_id": "s5",
      "type": "move_linear",
      "inputs": {
        "target_pose": {
          "ref": "target_zone_frame",
          "offset": [
            0.0,
            0.0,
            0.11
          ],
          "orientation_policy": "keep_current"
        }
      },
      "constraints": {
        "speed": 0.13,
        "collision_avoidance": true
      },
      "expected_effects": [
        "tcp_at_preplace_pose"
      ],
      "on_failure": {
        "policy": "replan_path"
      },
      "status": "planned"
    },
    {
      "step_id": "s6",
      "type": "place",
      "inputs": {
        "target_object": "block_red",
        "destination_pose": {
          "ref": "target_zone_frame",
          "offset": [
            -0.01,
            0.018,
            -0.01
          ],
          "orientation_policy": "align_to_fixture_pocket"
        },
        "target_feature": "fixture_pocket"
      },
      "constraints": {
        "placement_tolerance": 0.004
      },
      "expected_effects": [
        "object_at_destination:block_red:fixture_pocket"
      ],
      "on_failure": {
        "policy": "retry_with_pose_adjustment"
      },
      "status": "planned"
    },
    {
      "step_id": "s7",
      "type": "release",
      "inputs": {
        "target_object": "block_red"
      },
      "constraints": {},
      "expected_effects": [
        "release_completed",
        "object_detached:block_red"
      ],
      "on_failure": {
        "policy": "abort"
      },
      "status": "planned"
    },
    {
      "step_id": "s8",
      "type": "retreat",
      "inputs": {
        "direction": "tool_z_negative",
        "distance": 0.1
      },
      "constraints": {
        "speed": 0.12
      },
      "expected_effects": [
        "task_exit_complete"
      ],
      "on_failure": {
        "policy": "stop_and_hold"
      },
      "status": "planned"
    }
  ],
  "verification_policy": {
    "collision_check": true,
    "ik_check": true,
    "joint_limit_check": true,
    "velocity_limit_check": true,
    "force_limit_check": false,
    "max_retry": 3,
    "acceptance_rules": [
      "all_steps_executable",
      "no_collision",
      "object_at_destination:block_red:fixture_pocket"
    ]
  },
  "repair_state": {
    "retry_count": 0,
    "last_error": null,
    "repair_history": []
  }
}
